"""
Функція discavery_plate потрібна щоб знайти і витягти номерний знак із фото авто з використанням каскадів Хаара
"""

def discavery_plate(car_photo, car_cascade):
    # метод detectMultiScale об'єкта каскаду для виявлення прямокутників, що містять номерні знаки на зображенні.

    # що з себе представляють параметри
    # scaleFactor - наскільки зменшується розмір зображення на кожному етапі масштабування (від 1.0 до 1.5)
    # minNeighbors - скільки сусідніх прямокутників має бути, щоб зберегти об'єкт. 
    # цей параметр допомагає зменшити кількість помилкових спрацьовувань (від 3 до 6)

    car_rectangle = car_cascade.detectMultiScale(car_photo, 
                                                 scaleFactor=1.2,  #(від 1.0 до 1.5)
                                                 minNeighbors=5)   #(від 3 до 6)

    if len(car_rectangle) == 0:
        print("Sorry! No plates were found")
        return None
    
    # буде опрацьовано тільки перший знайдений прямокутник
    # x, y - координати верхнього лівого кута прямокутника
    # w, h - ширина та висота прямокутника

    for x, y, w, h in car_rectangle:
        cut_number = car_photo[y:y+h,  # Область по вертикалі від y до y + h (повна висота виявленого прямокутника).
                               x:x+w]  # Область по горизонталі від x до x + w (повна ширина виявленого прямокутника).
        return cut_number
    
    return None
